ServiceDesk/src/Enums/СтепениВажностиЗадачи/СтепениВажностиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтепениВажностиЗадачи</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Срочная</name>
  </enumValues>
</mdclass:Enum>

ServiceDesk/src/Documents/ЗаявкаПользователя/ЗаявкаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаПользователя</name>
  <basedOn>Document.ЗаявкаПользователя</basedOn>
  <registerRecords>AccumulationRegister.ВыполненыеЗаявки</registerRecords>
  <attributes>
    <name>Архитектор1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архитектор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>База1С</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.СтепениВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроллер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </attributes>
  <attributes>
    <name>РелизОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоёмкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроекта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <comment>Имя файла</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хранилище</name>
      <comment>Хранилище</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Наблюдатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/БазыДанных/БазыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Актуальная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольРелизов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольРобота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРобот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/CommonModules/ЗаявкаПользователя/Module.bsl
Функция ПолучитьРодительскиеДокументы(Заявка) Экспорт
	Если Заявка.Основание.Пустая() Тогда
		МассивДокументов	= Новый Массив;
	Иначе
		МассивДокументов	= ПолучитьРодительскиеДокументы(Заявка.Основание);
		МассивДокументов.Добавить(Заявка.Основание);
	КонецЕсли;
	Возврат МассивДокументов;
КонецФункции

Функция СформироватьДеревоДокументов(ЭтаФорма) Экспорт
	
	Объект				= ЭтаФорма.Объект;
	ДеревоДокументов	= ЭтаФорма.ДеревоДокументов;
	
	ДеревоДокументов.ПолучитьЭлементы().Очистить();		
	МассивРодительскихДокументов	= ЗаявкаПользователя.ПолучитьРодительскиеДокументы(Объект.Ссылка);
	
	ЭлементДерева	= ДеревоДокументов.ПолучитьЭлементы().Добавить();	
	Для Каждого Документ Из МассивРодительскихДокументов Цикл
		ЭлементДерева.Заявка	= Документ;
		ЭлементДерева			= ЭлементДерева.ПолучитьЭлементы().Добавить();
	КонецЦикла;
	
	ЭлементДерева.Заявка	= Объект.Ссылка;
	Идентификатор			= ЭлементДерева.ПолучитьИдентификатор();
	
	ЗаявкаПользователя.ПолучитьПодчиненныеДокументы(Объект.Ссылка, ЭлементДерева);
		
	Возврат Идентификатор;
	
КонецФункции

Процедура ПолучитьПодчиненныеДокументы(Заявка, ДеревоПодчиненых) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаПользователя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаПользователя КАК ЗаявкаПользователя
		|ГДЕ
		|	ЗаявкаПользователя.Основание = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока	= ДеревоПодчиненых.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Заявка	= Выборка.Ссылка;
		ПолучитьПодчиненныеДокументы(Выборка.Ссылка, НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	СтруктураОтвета	= РаботаСHTML.ПолучитьHTMLИзЗаявки(ТекущийОбъект.Ссылка);
	ЭтаФорма.ОписаниеHTML						= СтруктураОтвета.ОписаниеHTML;
	ЭтаФорма.КоличествоКомментариев				= "" + СтруктураОтвета.КоличествоКомментариев;
	ЭтаФорма.ОписаниеРазработчикаHTML			= СтруктураОтвета.ОписаниеРазработчикаHTML;
	ЭтаФорма.КоличествоКомментариевРазработчика	= "" + СтруктураОтвета.КоличествоКомментариевРазработчика;
КонецПроцедуры

Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры		= ЭтаФорма.Параметры;
	Объект			= ЭтаФорма.Объект;
	ТЗНаблюдатели	= ЭтаФорма.ТЗНаблюдатели;
	Элементы		= ЭтаФорма.Элементы;
	СписокЗадач		= ЭтаФорма.СписокЗадач;
	ЗадачиСотрудника= ЭтаФорма.ЗадачиСотрудника;
	
	Если Параметры.Ключ.Пустая() Тогда //Это новый документ надо его заполнить		
		Если Объект.Основание.Пустая() Тогда
			Объект.Дата					= ТекущаяДатаСеанса();
			Объект.Заказчик				= ПараметрыСеанса.ТекущийПользователь;
			Объект.БизнесНаправление	= Объект.Заказчик.Родитель.БизнесНаправление;
			Объект.ДатаВыполнения		= ДобавитьМесяц(Объект.Дата, 1);		
			Объект.База1С				= Объект.Заказчик.ОсновнаяБаза;
			Объект.Важность				= Перечисления.СтепениВажностиЗадачи.Средняя;
		КонецЕсли;		
		ЭтаФорма.Заголовок	= "Создание заявки";		
	Иначе				
		ОбщегоНазначенияСервер.УдалитьОповещениеВФоне(Объект.Ссылка);
		ЭтаФорма.СостояниеЗаявки	= ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Объект.Ссылка).СостояниеЗаявки;		
	КонецЕсли;
	
	ЭтаФорма.ТекущийПользователь	= ПараметрыСеанса.ТекущийПользователь;	
	ЭтаФорма.Организация			= Объект.Заказчик.Организация;	
	ЭтаФорма.КонтрольРелизов		= Объект.База1С.КонтрольРелизов;
	ТЗНаблюдатели.Загрузить(Объект.Наблюдатели.Выгрузить());
	
	Элементы.Основание.Видимость	= Не Объект.Основание.Пустая();
	
	ЭтаФорма.КоличествоВложенныхФайлов	= СокрЛП(Объект.ВложенныеФайлы.Количество());
	ЭтаФорма.КоличествоНаблюдателей	= СокрЛП(Объект.Наблюдатели.Количество());
	
	
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ЗаявкаПользователя",Объект.Ссылка);
	ЗадачиСотрудника.Параметры.УстановитьЗначениеПараметра("Исполнитель",Объект.Исполнитель);
	ЗадачиСотрудника.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", Объект.ДатаВыполнения + 604800);
	
	Если РольДоступна("Пользователь") Тогда		
		ЭтаФорма.ДоступнаРольПользователь	= Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Объект				= ЭтаФорма.Объект;
	СостояниеЗаявки		= ЭтаФорма.СостояниеЗаявки;
	ЕстьИзменения		= ЭтаФорма.ЕстьИзменения;	
	Модифицированность  = ЭтаФорма.Модифицированность;
	
	ЕстьИзменения	= Макс(ЕстьИзменения, Модифицированность);
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	
	Если Истина
		И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта 
		И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Выполнена 
		И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Отменена 
	Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.ДатаВыполнения) И ЗначениеЗаполнено(ТекущийОбъект.Релиз) И ТекущийОбъект.Релиз.ДатаВыхода < ТекущийОбъект.ДатаВыполнения Тогда			
			Сообщение	= Новый СообщениеПользователю;
			Сообщение.Текст			= "Срок выхода релиза меньше, даты выполнения задачи";
			Сообщение.Поле			= "ДатаВыполнения";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.КлючДанных	= Объект.Ссылка;               			
			Сообщение.Сообщить();
			Отказ	= Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Модифицированность Тогда
		СтруктураОтвета	= Справочники.БазыДанных.ПроверитьДоступностьИнформационнойСистемыПользователямЗаявки(ТекущийОбъект);
		Для Каждого Ответ Из СтруктураОтвета Цикл
			Сообщение	= Новый СообщениеПользователю;
			Сообщение.Текст			= Ответ.Значение;
			Сообщение.Поле			= Ответ.Ключ;
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.КлючДанных	= Объект.Ссылка;               			
			Сообщение.Сообщить();
			Отказ	= Истина;	
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	//Если ПараметрыЗаписи.Свойство("ДобавленКомментарий") Тогда
		//СписокЗадач		= ЭтаФорма.СписокЗадач;
		Объект			= ЭтаФорма.Объект;
		ЭтаФорма.СостояниеЗаявки	= ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Объект.Ссылка).СостояниеЗаявки;			
		ЭтаФорма.СписокЗадач.Параметры.УстановитьЗначениеПараметра("ЗаявкаПользователя", ТекущийОбъект.Ссылка);
	//КонецЕсли;	
КонецПроцедуры
